{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"channel_input": {"name": "channel_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "96"}, {"size": "96"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/shared_feature_extractor_1/conv2d_2_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/conv2d_2_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_4_1/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_4_1/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "8"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_4_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_5_1/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "24"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_5_1/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_5_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_6_1/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "24"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_6_1/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_6_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_7_1/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "24"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_7_1/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_7_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "channel_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "96"}, {"size": "96"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/conv2d_2_1/Relu", "op": "_FusedConv2D", "input": ["channel_input", "StatefulPartitionedCall/shared_feature_extractor_1/conv2d_2_1/convolution/ReadVariableOp", "StatefulPartitionedCall/shared_feature_extractor_1/conv2d_2_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/max_pooling2d_5_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/shared_feature_extractor_1/conv2d_2_1/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_4_1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/shared_feature_extractor_1/max_pooling2d_5_1/MaxPool2d", "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_4_1/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_4_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_4_1/separable_conv2d/depthwise", "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_4_1/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_4_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/max_pooling2d_6_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_4_1/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_5_1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/shared_feature_extractor_1/max_pooling2d_6_1/MaxPool2d", "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_5_1/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_5_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_5_1/separable_conv2d/depthwise", "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_5_1/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_5_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/max_pooling2d_7_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_5_1/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_6_1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/shared_feature_extractor_1/max_pooling2d_7_1/MaxPool2d", "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_6_1/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_6_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_6_1/separable_conv2d/depthwise", "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_6_1/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_6_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/max_pooling2d_8_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_6_1/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_7_1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/shared_feature_extractor_1/max_pooling2d_8_1/MaxPool2d", "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_7_1/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_7_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_7_1/separable_conv2d/depthwise", "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_7_1/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_7_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/max_pooling2d_9_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_7_1/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/shared_feature_extractor_1/max_pooling2d_9_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/shared_feature_extractor_1/conv2d_2_1/convolution/ReadVariableOp", "shape": [3, 3, 1, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/conv2d_2_1/Squeeze", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_4_1/separable_conv2d/ReadVariableOp", "shape": [3, 3, 8, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_4_1/separable_conv2d/ReadVariableOp_1", "shape": [1, 1, 8, 24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_4_1/Squeeze", "shape": [24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_5_1/separable_conv2d/ReadVariableOp", "shape": [3, 3, 24, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_5_1/separable_conv2d/ReadVariableOp_1", "shape": [1, 1, 24, 24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_5_1/Squeeze", "shape": [24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_6_1/separable_conv2d/ReadVariableOp", "shape": [3, 3, 24, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_6_1/separable_conv2d/ReadVariableOp_1", "shape": [1, 1, 24, 24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_6_1/Squeeze", "shape": [24], "dtype": "float32"}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_7_1/separable_conv2d/ReadVariableOp", "shape": [3, 3, 24, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_7_1/separable_conv2d/ReadVariableOp_1", "shape": [1, 1, 24, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/shared_feature_extractor_1/separable_conv2d_7_1/Squeeze", "shape": [16], "dtype": "float32"}]}]}